app/controllers/events_controller.rb

  def show
    @likers = @event.likers
    @categories = @event.categories
    if current_user
      @like = current_user.likes.find_by(event_id: @event.id)
---
SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."event_id" = ?  [["event_id", 9]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."event_id" = ? LIMIT ?  [["user_id", 1], ["event_id", 8], ["LIMIT", 1]]

  def update
    if @event.update(event_params)
---
UPDATE "events" SET "updated_at" = ?, "image_file_name" = ? WHERE "events"."id" = ?  [["updated_at", "2024-05-03 06:42:56.362504"], ["image_file_name", "ninjas.png"], ["id", 9]]

  def set_event
    @event = Event.find_by!(slug: params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."slug" = ? LIMIT ?  [["slug", "drone-zone"], ["LIMIT", 1]]