app/controllers/registrations_controller.rb

SELECT "events".* FROM "events" WHERE "events"."slug" = ? LIMIT ?  [["slug", "coding-ninjas"], ["LIMIT", 1]]
---
  def set_event
    @event = Event.find_by!(slug: params[:event_id])